[
  {
    "id": "gruzd-2020-coding-classifying",
    "title": "Coding and Classifying Knowledge Exchange on Social Media: a Comparative Analysis of the #Twitterstorians and AskHistorians Communities",
    "authors": "Anatoliy Gruzd, Priya Kumar, Deena Abul-Fottouh, Caroline Haythornthwaite",
    "journal": "Computer Supported Cooperative Work (CSCW)",
    "conference": "",
    "year": "2020",
    "url": "https://link.springer.com/article/10.1007/s10606-020-09376-y",
    "hypotheses": "Platform architecture significantly influences knowledge exchange patterns and community discourse structures",
    "notes": "Provides comprehensive framework for coding knowledge exchange patterns across different social media platforms. Compares Twitter vs Reddit knowledge sharing mechanisms.",
    "strengths": "Methodologically rigorous coding scheme; comparative platform analysis; focus on scholarly discourse patterns",
    "weaknesses": "Limited to academic knowledge sharing; focus on established scholarly communities rather than general interest communities",
    "citation": "Gruzd, A., Kumar, P., Abul-Fottouh, D., & Haythornthwaite, C. (2020). Coding and classifying knowledge exchange on social media: a comparative analysis of the# Twitterstorians and AskHistorians communities. Computer Supported Cooperative Work (CSCW), 29(6), 629-656.",
    "_isExample": false
  },
  {
    "id": "zhang-2021-relationships",
    "title": "Relationships Between User Knowledge Sharing in Virtual Community with Community Loyalty and Satisfaction",
    "authors": "Jiemei Zhang, Yuejie Ma, Bei Lyu",
    "journal": "Psychology Research and Behavior Management",
    "conference": "",
    "year": "2021",
    "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC8488053/",
    "hypotheses": "Knowledge sharing behaviors in virtual communities correlate with community loyalty and user satisfaction through social validation mechanisms",
    "notes": "Empirical study examining relationships between knowledge sharing, community engagement, and user satisfaction outcomes.",
    "strengths": "Large-scale empirical validation; clear theoretical framework linking behavior to outcomes",
    "weaknesses": "Limited focus on conversation patterns vs static knowledge sharing; primarily quantitative approach",
    "citation": "Zhang, J., Ma, Y., & Lyu, B. (2021). Relationships Between User Knowledge Sharing in Virtual Community with Community Loyalty and Satisfaction. Psychology Research and Behavior Management, 14, 1509-1523.",
    "_isExample": false
  },
  {
    "id": "agag-2021-cross-national",
    "title": "Cross-national differences in travelers' continuance of knowledge sharing in online travel communities",
    "authors": "Gomaa Agag, Riyad Eid, Wael Shehawy",
    "journal": "Journal of Business Research",
    "conference": "",
    "year": "2021",
    "url": "https://irep.ntu.ac.uk/id/eprint/45189/1/1505209_Agag.pdf",
    "hypotheses": "Cultural and economic development factors significantly influence knowledge sharing patterns and continuance intentions in travel communities",
    "notes": "Cross-cultural study of 6,803 travelers across four countries examining factors motivating knowledge sharing continuance.",
    "strengths": "Large sample size; cross-cultural validation; focus specifically on travel communities",
    "weaknesses": "Survey-based methodology lacks conversational pattern analysis; limited temporal dimension",
    "citation": "Agag, G., Eid, R., & Shehawy, W. (2021). Cross-national differences in travelers' continuance of knowledge sharing in online travel communities. Journal of Business Research, 128, 454-463.",
    "_isExample": false
  },
  {
    "id": "fu-2016-toward-classification",
    "title": "Toward a classification of discourse patterns in asynchronous online discussions",
    "authors": "Ella L. F. Fu, Jan van Aalst, Carol K. K. Chan",
    "journal": "International Journal of Computer-Supported Collaborative Learning",
    "conference": "",
    "year": "2016",
    "url": "https://link.springer.com/content/pdf/10.1007/s11412-016-9245-3.pdf",
    "hypotheses": "Distinct discourse patterns can be classified to distinguish knowledge sharing, knowledge construction, and knowledge building modes",
    "notes": "Develops nine-pattern classification system for online discourse using qualitative coding and narrative analysis.",
    "strengths": "Comprehensive pattern classification; qualitative-quantitative integration; educational context validation",
    "weaknesses": "Limited to educational forums; small sample size; lacks temporal analysis",
    "citation": "Fu, E. L. F., van Aalst, J., & Chan, C. K. K. (2016). Toward a classification of discourse patterns in asynchronous online discussions. International Journal of Computer-Supported Collaborative Learning, 11(4), 441-478.",
    "_isExample": false
  },
  {
    "id": "herring-cmda-framework",
    "title": "Computer-Mediated Discourse Analysis: An Approach to Researching Online Behavior",
    "authors": "Susan C. Herring",
    "journal": "Book Chapter",
    "conference": "",
    "year": "2004",
    "url": "https://homes.luddy.indiana.edu/herring/cmda.html",
    "hypotheses": "Micro-level discourse analysis can reveal macro-level social phenomena in computer-mediated communication",
    "notes": "Foundational framework for Computer-Mediated Discourse Analysis (CMDA) methodology for studying online behavior through discourse patterns.",
    "strengths": "Foundational theoretical framework; empirically grounded; avoids premature generalizations about online communities",
    "weaknesses": "General framework rather than domain-specific application; limited computational automation",
    "citation": "Herring, S. C. (2004). Computer-mediated discourse analysis: An approach to researching online behavior. Designing for virtual communities in the service of learning, 338-376.",
    "_isExample": false
  },
  {
    "id": "lee-tan-2017-temporal",
    "title": "Temporal analytics with discourse analysis: tracing ideas and impact on communal discourse",
    "authors": "Alwyn Vwen Yen Lee, Seng Chee Tan",
    "journal": "ACM Digital Library",
    "conference": "Learning Analytics and Knowledge Conference",
    "year": "2017",
    "url": "https://dl.acm.org/doi/10.1145/3027385.3027386",
    "hypotheses": "Temporal analytics combined with discourse analysis can trace idea evolution and impact on communal discourse",
    "notes": "Pioneers methodology combining temporal analytics with step-wise discourse analysis to trace ideas through online discussions.",
    "strengths": "Novel temporal-discourse integration; idea tracing methodology; community impact measurement",
    "weaknesses": "Small sample size (281 posts); educational context only; limited scalability",
    "citation": "Lee, A. V. Y., & Tan, S. C. (2017). Temporal analytics with discourse analysis: tracing ideas and impact on communal discourse. Proceedings of the Seventh International Learning Analytics & Knowledge Conference, 383-387.",
    "_isExample": false
  },
  {
    "id": "yang-leskovec-2011-patterns",
    "title": "Patterns of Temporal Variation in Online Media",
    "authors": "Jaewon Yang, Jure Leskovec",
    "journal": "WSDM",
    "conference": "Web Search and Data Mining",
    "year": "2011",
    "url": "https://cs.stanford.edu/people/jure/pubs/memeshapes-wsdm11.pdf",
    "hypotheses": "Online content exhibits distinct temporal patterns that can be systematically identified and clustered",
    "notes": "Large-scale analysis of 580M tweets and 170M blog posts identifying six main temporal shapes of online attention.",
    "strengths": "Massive dataset; K-Spectral Centroid clustering algorithm; temporal pattern identification",
    "weaknesses": "Focus on content popularity rather than conversational patterns; limited to attention metrics",
    "citation": "Yang, J., & Leskovec, J. (2011). Patterns of temporal variation in online media. Proceedings of the fourth ACM international conference on Web search and data mining, 177-186.",
    "_isExample": false
  },
  {
    "id": "burton-2024-llm-collective",
    "title": "How Large Language Models Can Reshape Collective Intelligence",
    "authors": "Jason W. Burton, Ezequiel Lopez-Lopez, Shahar Hechtlinger, et al.",
    "journal": "Nature Human Behaviour",
    "conference": "",
    "year": "2024",
    "url": "https://www.nature.com/articles/s41562-024-01959-9",
    "hypotheses": "Large language models can enhance rather than replace human collective intelligence through complementary capabilities",
    "notes": "Interdisciplinary perspective on AI-enhanced collective intelligence, examining opportunities and challenges for human-AI collaboration.",
    "strengths": "Comprehensive interdisciplinary approach; practical implications; future-oriented framework",
    "weaknesses": "Limited empirical validation; focus on AI integration rather than pure human collective intelligence",
    "citation": "Burton, J. W., et al. (2024). How large language models can reshape collective intelligence. Nature Human Behaviour, 8(9), 1671-1680.",
    "_isExample": false
  },
  {
    "id": "luo-2009-community-intelligence",
    "title": "Toward collective intelligence of online communities: A primitive conceptual model",
    "authors": "Shuangling Luo, Haoxiang Xia, Taketoshi Yoshida, Zhongtuo Wang",
    "journal": "Journal of Systems Science and Systems Engineering",
    "conference": "",
    "year": "2009",
    "url": "https://journal.hep.com.cn/jossase/EN/10.1007/s11518-009-5095-0",
    "hypotheses": "Community intelligence emerges from interactions in knowledge supernetworks comprising media, human, and knowledge networks",
    "notes": "Conceptual model distinguishing 'knowing' (tacit) from 'knoware' (explicit, actionable) knowledge in community intelligence systems.",
    "strengths": "Integrated theoretical framework; knowledge supernetwork model; tacit-explicit knowledge distinction",
    "weaknesses": "Conceptual only without empirical validation; limited operational definitions",
    "citation": "Luo, S., Xia, H., Yoshida, T., & Wang, Z. (2009). Toward collective intelligence of online communities: A primitive conceptual model. Journal of Systems Science and Systems Engineering, 18(2), 203-221.",
    "_isExample": false
  },
  {
    "id": "chen-2025-structural-holes",
    "title": "Structural Holes and Peer Knowledge Production in Professional Q&A Communities: A Middle-Range Theory of User Engagement",
    "authors": "Langtao Chen, Aaron Baird, Detmar Straub",
    "journal": "Journal of the Association for Information Systems",
    "conference": "",
    "year": "2025",
    "url": "https://aisel.aisnet.org/jais/vol26/iss2/7/",
    "hypotheses": "Network positions and structural holes significantly influence knowledge production and user engagement in professional Q&A communities",
    "notes": "Develops middle-range theory explaining how social network positions affect knowledge contribution patterns in professional communities.",
    "strengths": "Strong theoretical foundation; professional community focus; network position analysis",
    "weaknesses": "Limited to professional Q&A format; less applicable to casual travel forums",
    "citation": "Chen, L., Baird, A., & Straub, D. (2025). Structural holes and peer knowledge production in professional Q&A communities: A middle-range theory of user engagement. Journal of the Association for Information Systems, 26(2), Article 7.",
    "_isExample": false
  },
  {
    "id": "hillman-2021-knowledge-sharing",
    "title": "Knowledge Sharing in Tension: Interacting and Documenting on Stack Overflow",
    "authors": "Thomas Hillman, Alena Seredko, Markus Nivala, Tanya Osborne",
    "journal": "ACM Digital Library",
    "conference": "CHI Conference on Human Factors in Computing Systems",
    "year": "2021",
    "url": "https://dl.acm.org/doi/10.1145/3430895.3460981",
    "hypotheses": "Tension exists between documenting knowledge for searchability and supporting real-time interactive problem-solving",
    "notes": "Examines how platform design affects balance between creating knowledge repositories and supporting conversational help-seeking.",
    "strengths": "Platform design implications; tension identification; practical insights for community platforms",
    "weaknesses": "Limited to technical Q&A communities; single platform focus",
    "citation": "Hillman, T., Seredko, A., Nivala, M., & Osborne, T. (2021). Knowledge sharing in tension: Interacting and documenting on Stack Overflow. Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems, 1-14.",
    "_isExample": false
  },
  {
    "id": "zhou-2021-understanding-otc",
    "title": "Understanding online travel communities: a literature review and future research directions in hospitality and tourism",
    "authors": "Yuan Zhou, Woo Gon Kim, Bendegul Okumus, Cihan Cobanoglu",
    "journal": "Journal of Travel & Tourism Marketing",
    "conference": "",
    "year": "2021",
    "url": "https://www.researchgate.net/publication/350104227_Understanding_online_travel_communities_a_literature_review_and_future_research_directions_in_hospitality_and_tourism",
    "hypotheses": "Online travel community research can be systematically categorized to identify gaps and future research directions",
    "notes": "Comprehensive literature review of 71 OTC articles (2002-2020) identifying four topical clusters and research gaps.",
    "strengths": "Comprehensive systematic review; identifies research gaps; travel-specific focus",
    "weaknesses": "Review study rather than empirical research; limited methodological innovation",
    "citation": "Zhou, Y., Kim, W. G., Okumus, B., & Cobanoglu, C. (2021). Understanding online travel communities: a literature review and future research directions in hospitality and tourism. Journal of Travel & Tourism Marketing, 38(2), 194-212.",
    "_isExample": false
  },
  {
    "id": "zabudska-2024-tourism-communities",
    "title": "Identifying Patterns among Tourism-Oriented Online Communities on Facebook",
    "authors": "Eva Zabudská, Kristína Pompurová",
    "journal": "Tourism and Hospitality",
    "conference": "",
    "year": "2024",
    "url": "https://www.mdpi.com/2673-5768/5/3/48",
    "hypotheses": "Tourism-oriented online communities exhibit distinct patterns of structural and managerial dynamics that correlate with effectiveness",
    "notes": "Develops typology of tourism communities on Facebook analyzing structural and managerial dynamics affecting engagement.",
    "strengths": "Tourism-specific focus; structural-managerial integration; community effectiveness metrics",
    "weaknesses": "Single platform (Facebook); limited to community management rather than conversational patterns",
    "citation": "Zabudská, E., & Pompurová, K. (2024). Identifying Patterns among Tourism-Oriented Online Communities on Facebook. Tourism and Hospitality, 5(3), 48.",
    "_isExample": false
  },
  {
    "id": "casalo-2010-firm-hosted",
    "title": "Determinants of the intention to participate in firm-hosted online travel communities",
    "authors": "Luis V. Casaló, Carlos Flavián, Miguel Guinalíu",
    "journal": "Tourism Management",
    "conference": "",
    "year": "2010",
    "url": "https://www.sciencedirect.com/science/article/abs/pii/S0261517710000828",
    "hypotheses": "Participation intentions in firm-hosted travel communities are driven by Theory of Planned Behavior, Technology Acceptance, and Social Identity factors",
    "notes": "Integrates multiple theoretical frameworks to explain participation intentions in firm-hosted online travel communities.",
    "strengths": "Multi-theoretical integration; firm-hosted community focus; behavioral intention modeling",
    "weaknesses": "Limited to firm-hosted rather than organic communities; survey methodology only",
    "citation": "Casaló, L. V., Flavián, C., & Guinalíu, M. (2010). Determinants of the intention to participate in firm-hosted online travel communities. Tourism Management, 31(6), 898-911.",
    "_isExample": false
  },
  {
    "id": "jiang-2025-network-analysis",
    "title": "Editorial: Network analysis of social media texts",
    "authors": "Ke Jiang, Weiai Xu, James Danowski",
    "journal": "Frontiers in Research Metrics and Analytics",
    "conference": "",
    "year": "2025",
    "url": "https://www.frontiersin.org/journals/research-metrics-and-analytics/articles/10.3389/frma.2025.1558798/pdf",
    "hypotheses": "Network analysis methods can effectively illuminate structures and dynamics of social media discourse",
    "notes": "Editorial introducing network analysis approaches for social media text analysis, emphasizing semantic and coherency network analysis.",
    "strengths": "Methodological focus; semantic network emphasis; social media applicability",
    "weaknesses": "Editorial format limits empirical content; general rather than domain-specific",
    "citation": "Jiang, K., Xu, W. W., & Danowski, J. (2025). Editorial: Network analysis of social media texts. Frontiers in Research Metrics and Analytics, 10, 1558798.",
    "_isExample": false
  },
  {
    "id": "brambilla-2022-graph-conversation",
    "title": "Graph-Based Conversation Analysis in Social Media",
    "authors": "Marco Brambilla, Alireza Javadian Sabet, Kalyani Kharmale, Amin Endah Sulistiawati",
    "journal": "Big Data and Cognitive Computing",
    "conference": "",
    "year": "2022",
    "url": "https://www.mdpi.com/2504-2289/6/4/113",
    "hypotheses": "Graph-based models can effectively capture conversation flows and structural properties in social media discussions",
    "notes": "Develops graph-based methods for modeling conversation flows, capturing structural properties and temporal dynamics.",
    "strengths": "Graph-based methodology; conversation flow modeling; structural property analysis",
    "weaknesses": "Technical methodology focus; limited domain application; lacks empirical validation on travel forums",
    "citation": "Brambilla, M., Javadian Sabet, A., Kharmale, K., & Sulistiawati, A. E. (2022). Graph-Based Conversation Analysis in Social Media. Big Data and Cognitive Computing, 6(4), 113.",
    "_isExample": false
  },
  {
    "id": "lee-tsai-2011-collaborative",
    "title": "Identifying Patterns of Collaborative Knowledge Exploration in Online Asynchronous Discussions",
    "authors": "Silvia Wen-Yu Lee, Chin-Chung Tsai",
    "journal": "Instructional Science",
    "conference": "",
    "year": "2011",
    "url": "https://www.learntechlib.org/p/53089/",
    "hypotheses": "Collaborative knowledge exploration exhibits identifiable patterns that can be analyzed through mixed-method approaches",
    "notes": "Six-week study of 11 graduate students integrating quantitative pattern identification with qualitative interpretation.",
    "strengths": "Mixed-method integration; longitudinal design; collaborative knowledge exploration focus",
    "weaknesses": "Small sample size; educational context only; limited generalizability to travel forums",
    "citation": "Lee, S. W. Y., & Tsai, C. C. (2011). Identifying patterns of collaborative knowledge exploration in online asynchronous discussions. Instructional Science, 39(3), 321-347.",
    "_isExample": false
  },
  {
    "id": "malmberg-2017-temporal-sequential",
    "title": "Capturing temporal and sequential patterns of self-, co-, and socially shared regulation in the context of collaborative learning",
    "authors": "Jonna Malmberg, Sanna Järvelä, Hanna Järvenoja",
    "journal": "Contemporary Educational Psychology",
    "conference": "",
    "year": "2017",
    "url": "https://www.sciencedirect.com/science/article/abs/pii/S0361476X17300115",
    "hypotheses": "Sequential patterns of self-regulated, co-regulated, and socially shared regulation can be captured and analyzed in collaborative contexts",
    "notes": "Develops methodology for capturing temporal and sequential patterns of regulation in collaborative learning environments.",
    "strengths": "Temporal-sequential pattern analysis; collaborative context; regulation pattern identification",
    "weaknesses": "Educational context only; limited to regulation patterns rather than knowledge transfer",
    "citation": "Malmberg, J., Järvelä, S., & Järvenoja, H. (2017). Capturing temporal and sequential patterns of self-, co-, and socially shared regulation in the context of collaborative learning. Contemporary Educational Psychology, 49, 160-174.",
    "_isExample": false
  },
  {
    "id": "koivisto-2023-conversation-analytic",
    "title": "Conversation Analytic Perspectives to Digital Interaction: Practices, Resources, and Affordances",
    "authors": "Aino Koivisto, Heidi Vepsäläinen, Mikko T. Virtanen",
    "journal": "Book - Finnish Literature Society",
    "conference": "",
    "year": "2023",
    "url": "https://oa.finlit.fi/site/books/e/10.21435/sflin.22/",
    "hypotheses": "Traditional conversation analysis methods can be adapted to understand digital interaction practices and affordances",
    "notes": "Comprehensive coverage of conversation analytic approaches to digital interaction, examining practices, resources, and technological affordances.",
    "strengths": "Comprehensive methodological coverage; digital interaction focus; conversation analysis adaptation",
    "weaknesses": "General methodology rather than specific application; limited empirical examples",
    "citation": "Koivisto, A., Vepsäläinen, H., & Virtanen, M. T. (Eds.). (2023). Conversation Analytic Perspectives to Digital Interaction: Practices, Resources, and Affordances. Finnish Literature Society.",
    "_isExample": false
  },
  {
    "id": "avalle-2024-persistent-interaction",
    "title": "Persistent interaction patterns across social media platforms and over time",
    "authors": "Michele Avalle, Niccolò Di Marco, Gabriele Etta, et al.",
    "journal": "Nature",
    "conference": "",
    "year": "2024",
    "url": "https://www.nature.com/articles/s41586-024-07229-y",
    "hypotheses": "Conversation patterns and user behaviors remain consistent across platforms and time periods despite technological differences",
    "notes": "Large-scale analysis across eight platforms over 34 years showing consistent conversation patterns regardless of platform, topic, or time.",
    "strengths": "Massive temporal and cross-platform scope; consistent pattern identification; toxicity analysis",
    "weaknesses": "Focus on toxicity rather than positive knowledge sharing patterns; limited to conversation length and participation",
    "citation": "Avalle, M., Di Marco, N., Etta, G., et al. (2024). Persistent interaction patterns across social media platforms and over time. Nature, 630(8016), 363-370.",
    "_isExample": false
  },
  {
    "id": "edelmann-2020-computational-sociology",
    "title": "Computational Social Science and Sociology",
    "authors": "Achim Edelmann, Tom Wolff, Danielle Montagne, Christopher A. Bail",
    "journal": "Annual Review of Sociology",
    "conference": "",
    "year": "2020",
    "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC8612450/",
    "hypotheses": "Computational methods can enhance traditional sociological analysis while maintaining theoretical rigor",
    "notes": "Comprehensive review of computational social science integration with sociology, examining opportunities and challenges.",
    "strengths": "Comprehensive methodological review; theoretical-computational integration; sociological grounding",
    "weaknesses": "Review study rather than empirical application; general rather than domain-specific",
    "citation": "Edelmann, A., Wolff, T., Montagne, D., & Bail, C. A. (2020). Computational social science and sociology. Annual Review of Sociology, 46, 61-81.",
    "_isExample": false
  },
  {
    "id": "seo-2020-social-interactions",
    "title": "Does Who Helps You Impact Your Behavior? Examining the Effects of Social Interactions on Knowledge Sharing in Online Communities",
    "authors": "Eunkwang Seo, Frank Nagle, Sonali Shah",
    "journal": "Harvard Business School Strategy Unit Working Paper",
    "conference": "",
    "year": "2020",
    "url": "https://papers.ssrn.com/sol3/papers.cfm?abstract_id=3680076",
    "hypotheses": "Social interaction patterns and helper characteristics significantly influence knowledge sharing behaviors in online communities",
    "notes": "Examines how social interactions affect knowledge sharing behavior, particularly focusing on new member engagement and community growth.",
    "strengths": "Social interaction focus; community growth implications; new member engagement analysis",
    "weaknesses": "Working paper status; limited to specific community types; lacks travel forum application",
    "citation": "Seo, E., Nagle, F., & Shah, S. (2020). Does who helps you impact your behavior? Examining the effects of social interactions on knowledge sharing in online communities. Harvard Business School Strategy Unit Working Paper, (21-026).",
    "_isExample": false
  },
  {
    "id": "hu-2024-systematic-review",
    "title": "Why We Share: A Systematic Review of Knowledge-Sharing Intentions on Social Media Platforms",
    "authors": "Jia Hu, Shuhaida Md Noor",
    "journal": "Behavioral Sciences",
    "conference": "",
    "year": "2024",
    "url": "https://www.mdpi.com/2076-328X/14/8/636",
    "hypotheses": "Knowledge-sharing intentions on social media are influenced by psychological, technological, environmental, and social factors centered on trust and attitude",
    "notes": "Systematic review identifying 47 determinants of knowledge-sharing intentions across four key themes, with Zhihu as the most studied platform.",
    "strengths": "Systematic methodology; comprehensive factor identification; recent publication",
    "weaknesses": "Review study rather than empirical research; limited to intentions rather than actual behavior patterns",
    "citation": "Hu, J., & Noor, S. M. (2024). Why We Share: A Systematic Review of Knowledge-Sharing Intentions on Social Media Platforms. Behavioral Sciences, 14(8), 636.",
    "_isExample": false
  }
]